---
kind: property
id: P:Autodesk.Revit.DB.Electrical.DistributionSysType.VoltageLineToGround
source: html/ec5e6690-0d63-45d1-5414-f8115bcf6965.htm
---
# Autodesk.Revit.DB.Electrical.DistributionSysType.VoltageLineToGround Property

Get or set line to ground voltage of distribution system type.

## Syntax (C#)
```csharp
public VoltageType VoltageLineToGround { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The voltage retrieved here is read only and actions to modify its properties it will throw an System.InvalidOperationException.